# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Binaries
brew "mas" # Mac App Store manager

# Services
brew "ollama", restart_service: true

# Apps
cask "boop"
cask "dash"
cask "docker"
cask "firefox"
cask "fleet"
cask "hoppscotch"
cask "intellij-idea-ce"
cask "maccy"
cask "mongodb-compass"
cask "obsidian"
cask "ollamac"
cask "rectangle"
cask "warp"

#oh-my-zsh
brew "zsh-autocomplete"
brew "zsh-autosuggestions"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Grocy Mobile", id: 1567803209
mas "Snippet", id: 1613020051
mas "Tailscale", id: 1475387142
